# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11n with Cross-Attention Feature Fusion in the Neck
# This model requires a custom 'CrossAttentionBlock' module to be defined and registered.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head with Cross-Attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11. Output has 1024 channels (from layer 10)

  # --- MODIFIED SECTION START ---
  # NEW: Use Cross-Attention to fuse upsampled P5 with backbone P4
  # Query: from layer 11 (Upsampled P5, 1024 ch)
  # Key/Value: from layer 6 (Backbone P4, 512 ch)
  - [[-1, 6], 1, CrossAttentionBlock, [1024, 512]] # 12. NEW Cross-Attention layer. Output: 1024 ch.
  
  # NEW: Concat the result of attention with the original upsampled query stream
  - [[-1, -2], 1, Concat, [1]] # 13. NEW Concat. Output: 1024 (from CA) + 1024 (from Upsample) = 2048 ch.

  # UPDATED: Process the fused features. Input channels are now 2048.
  - [-1, 2, C3k2, [512, False]] # 14. UPDATED (was layer 13). Output: 512 ch.
  # --- MODIFIED SECTION END ---

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15. UPDATED (was 14)
  # UPDATED: Concat with CORRECT backbone P3 layer (layer 3 has 256 ch at P3 scale)
  - [[-1, 3], 1, Concat, [1]] # 16. UPDATED (was 15). cat backbone P3 from layer 3.
  - [-1, 2, C3k2, [256, False]] # 17. UPDATED (was 16). (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 18. UPDATED (was 17)
  # UPDATED: Concat with the output of the first fusion block in the neck (now layer 14)
  - [[-1, 14], 1, Concat, [1]] # 19. UPDATED (was 18). cat head P4 from layer 14.
  - [-1, 2, C3k2, [512, False]] # 20. UPDATED (was 19). (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 21. UPDATED (was 20)
  # UPDATED: Concat with P5 features from the backbone (layer 10)
  - [[-1, 10], 1, Concat, [1]] # 22. UPDATED (was 21). cat head P5.
  - [-1, 2, C3k2, [1024, True]] # 23. UPDATED (was 22). (P5/32-large)

  # UPDATED: Detect head now takes features from new layer indices
  - [[17, 20, 23], 1, Detect, [nc]] # 24. UPDATED Detect(P3, P4, P5)